using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.ComponentModel.DataAnnotations;
using System.ComponentModel;
using System.Xml.Serialization;

namespace TechnoLogica.Eservices.InformationObjects.Nomenclatures
{
    /// <summary>
    /// Номенклатура на видовете доставчици на електронни административни услуги.
    /// </summary>
    public enum ElectronicServiceProviderType
    {
        /// <summary>
        /// Използва се за обозначаване на вид доставчик на електронни административни услуги. 
        /// "Административен орган" е органът, който принадлежи към системата на изпълнителната власт, 
        /// както и всеки носител на административни правомощия, овластен въз основа на закон.
        /// </summary>
        [Display(ResourceType = typeof(Resources.Terms), Name = "_0006_000031")]
        [XmlEnum("0006-000031")]
        AdministrativeAuthority,
        /// <summary>
        /// Използва се за обозначаване на вид доставчик на електронни административни услуги. 
        /// "Лица, осъществяващи публични функции" са нотариусите, частните съдебни изпълнители, 
        /// държавните и общинските учебни заведения, държавните и общинските лечебни заведения 
        /// и други лица и организации, чрез които държавата упражнява своите функции и на които това е възложено със закон
        /// </summary>
        [Display(ResourceType = typeof(Resources.Terms), Name = "_0006_000032")]
        [XmlEnum("0006-000032")]
        PersonPerformingPublicFunctions,
        /// <summary>
        /// Използва се за обозначаване на вид доставчик на електронни административни услуги. 
        /// "Организация, предоставяща обществени услуги" е всяка организация, независимо от правната форма на учредяването й, 
        /// която предоставя една или повече от следните услуги - образователни, здравни, водоснабдителни, канализационни, 
        /// топлоснабдителни, електроснабдителни, газоснабдителни, телекомуникационни, пощенски или други подобни услуги, 
        /// предоставени за задоволяване на обществени потребности, включително като търговска дейност, по повод на чието 
        /// предоставяне могат да се извършват административни услуги.
        /// </summary>
        [Display(ResourceType = typeof(Resources.Terms), Name = "_0006_000033")]
        [XmlEnum("0006-000033")]
        OrganizationProvidingPublicServices
    }
}
